Revit 2026 API

# DocumentNewFlexDuct(Connector, IListXYZ, FlexDuctType) Method

---
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FlexDuct NewFlexDuct(
	Connector connector,
	IList<XYZ> points,
	FlexDuctType ductType
)
```
```vb
Public Function NewFlexDuct (
	connector As Connector,
	points As IList(Of XYZ),
	ductType As FlexDuctType
) As FlexDuct
```
```cpp
public:
FlexDuct^ NewFlexDuct(
	Connector^ connector,
	IList<XYZ^>^ points,
	FlexDuctType^ ductType
)
```
```fsharp
member NewFlexDuct :
        connector : Connector *
        points : IList<XYZ> *
        ductType : FlexDuctType -> FlexDuct
```

#### Parameters

connector Connector

points IListXYZ

ductType FlexDuctType

#### Return Value

FlexDuct

#### Reference

Document Class

NewFlexDuct Overload

Autodesk.Revit.Creation Namespace